{
  "model_type": "llama",
  "architectures": ["LlamaForCausalLM"],
  "hidden_size": 2048,
  "intermediate_size": 8192,
  "num_hidden_layers": 16,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-05,
  "hidden_act": "silu",

  "vocab_size": 128256,
  "max_position_embeddings": 2048,
  "rope_theta": 1000000.0,

  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "rope_scaling": null,

  "pad_token_id": 0,
  "bos_token_id": 128000,
  "eos_token_id": 128001,

  "tokenizer_class": "LlamaTokenizer"
}